bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/ef_data_reg.h
/* 0x54 : ef_key_slot_3_w2 */
#define EF_DATA_EF_KEY_SLOT_3_W2_OFFSET (0x54)
#define EF_DATA_EF_KEY_SLOT_3_W2        EF_DATA_EF_KEY_SLOT_3_W2
#define EF_DATA_EF_KEY_SLOT_3_W2_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_3_W2_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_3_W2_MSK    (((1U << EF_DATA_EF_KEY_SLOT_3_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_3_W2_POS)
#define EF_DATA_EF_KEY_SLOT_3_W2_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_3_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_3_W2_POS))

/* 0x58 : ef_key_slot_3_w3 */
#define EF_DATA_EF_KEY_SLOT_3_W3_OFFSET (0x58)
#define EF_DATA_EF_KEY_SLOT_3_W3        EF_DATA_EF_KEY_SLOT_3_W3
#define EF_DATA_EF_KEY_SLOT_3_W3_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_3_W3_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_3_W3_MSK    (((1U << EF_DATA_EF_KEY_SLOT_3_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_3_W3_POS)
#define EF_DATA_EF_KEY_SLOT_3_W3_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_3_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_3_W3_POS))

/* 0x5C : ef_key_slot_4_w0 */
#define EF_DATA_EF_KEY_SLOT_4_W0_OFFSET (0x5C)
#define EF_DATA_EF_KEY_SLOT_4_W0        EF_DATA_EF_KEY_SLOT_4_W0
#define EF_DATA_EF_KEY_SLOT_4_W0_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_4_W0_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_4_W0_MSK    (((1U << EF_DATA_EF_KEY_SLOT_4_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_4_W0_POS)
#define EF_DATA_EF_KEY_SLOT_4_W0_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_4_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_4_W0_POS))

/* 0x60 : ef_key_slot_4_w1 */
#define EF_DATA_EF_KEY_SLOT_4_W1_OFFSET (0x60)
#define EF_DATA_EF_KEY_SLOT_4_W1        EF_DATA_EF_KEY_SLOT_4_W1
#define EF_DATA_EF_KEY_SLOT_4_W1_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_4_W1_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_4_W1_MSK    (((1U << EF_DATA_EF_KEY_SLOT_4_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_4_W1_POS)
#define EF_DATA_EF_KEY_SLOT_4_W1_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_4_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_4_W1_POS))

/* 0x64 : ef_key_slot_4_w2 */
#define EF_DATA_EF_KEY_SLOT_4_W2_OFFSET (0x64)
#define EF_DATA_EF_KEY_SLOT_4_W2        EF_DATA_EF_KEY_SLOT_4_W2
#define EF_DATA_EF_KEY_SLOT_4_W2_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_4_W2_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_4_W2_MSK    (((1U << EF_DATA_EF_KEY_SLOT_4_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_4_W2_POS)
#define EF_DATA_EF_KEY_SLOT_4_W2_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_4_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_4_W2_POS))

/* 0x68 : ef_key_slot_4_w3 */
#define EF_DATA_EF_KEY_SLOT_4_W3_OFFSET (0x68)
#define EF_DATA_EF_KEY_SLOT_4_W3        EF_DATA_EF_KEY_SLOT_4_W3
#define EF_DATA_EF_KEY_SLOT_4_W3_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_4_W3_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_4_W3_MSK    (((1U << EF_DATA_EF_KEY_SLOT_4_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_4_W3_POS)
#define EF_DATA_EF_KEY_SLOT_4_W3_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_4_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_4_W3_POS))

/* 0x6C : ef_key_slot_5_w0 */
#define EF_DATA_EF_KEY_SLOT_5_W0_OFFSET (0x6C)
#define EF_DATA_EF_KEY_SLOT_5_W0        EF_DATA_EF_KEY_SLOT_5_W0
#define EF_DATA_EF_KEY_SLOT_5_W0_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_5_W0_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_5_W0_MSK    (((1U << EF_DATA_EF_KEY_SLOT_5_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_5_W0_POS)
#define EF_DATA_EF_KEY_SLOT_5_W0_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_5_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_5_W0_POS))

/* 0x70 : ef_key_slot_5_w1 */
#define EF_DATA_EF_KEY_SLOT_5_W1_OFFSET (0x70)
#define EF_DATA_EF_KEY_SLOT_5_W1        EF_DATA_EF_KEY_SLOT_5_W1
#define EF_DATA_EF_KEY_SLOT_5_W1_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_5_W1_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_5_W1_MSK    (((1U << EF_DATA_EF_KEY_SLOT_5_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_5_W1_POS)
#define EF_DATA_EF_KEY_SLOT_5_W1_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_5_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_5_W1_POS))

/* 0x74 : ef_key_slot_5_w2 */
#define EF_DATA_EF_KEY_SLOT_5_W2_OFFSET (0x74)
#define EF_DATA_EF_KEY_SLOT_5_W2        EF_DATA_EF_KEY_SLOT_5_W2
#define EF_DATA_EF_KEY_SLOT_5_W2_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_5_W2_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_5_W2_MSK    (((1U << EF_DATA_EF_KEY_SLOT_5_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_5_W2_POS)
#define EF_DATA_EF_KEY_SLOT_5_W2_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_5_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_5_W2_POS))

/* 0x78 : ef_key_slot_5_w3 */
#define EF_DATA_EF_KEY_SLOT_5_W3_OFFSET (0x78)
#define EF_DATA_EF_KEY_SLOT_5_W3        EF_DATA_EF_KEY_SLOT_5_W3
#define EF_DATA_EF_KEY_SLOT_5_W3_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_5_W3_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_5_W3_MSK    (((1U << EF_DATA_EF_KEY_SLOT_5_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_5_W3_POS)
#define EF_DATA_EF_KEY_SLOT_5_W3_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_5_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_5_W3_POS))

/* 0x7C : EF_DATA_lock */
#define EF_DATA_LOCK_OFFSET               (0x7C)
#define EF_DATA_EF_ANA_TRIM_1             EF_DATA_EF_ANA_TRIM_1
#define EF_DATA_EF_ANA_TRIM_1_POS         (0U)
#define EF_DATA_EF_ANA_TRIM_1_LEN         (13U)
#define EF_DATA_EF_ANA_TRIM_1_MSK         (((1U << EF_DATA_EF_ANA_TRIM_1_LEN) - 1) << EF_DATA_EF_ANA_TRIM_1_POS)
#define EF_DATA_EF_ANA_TRIM_1_UMSK        (~(((1U << EF_DATA_EF_ANA_TRIM_1_LEN) - 1) << EF_DATA_EF_ANA_TRIM_1_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_4_L      EF_DATA_WR_LOCK_KEY_SLOT_4_L
#define EF_DATA_WR_LOCK_KEY_SLOT_4_L_POS  (13U)
#define EF_DATA_WR_LOCK_KEY_SLOT_4_L_LEN  (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_4_L_MSK  (((1U << EF_DATA_WR_LOCK_KEY_SLOT_4_L_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_4_L_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_4_L_UMSK (~(((1U << EF_DATA_WR_LOCK_KEY_SLOT_4_L_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_4_L_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_5_L      EF_DATA_WR_LOCK_KEY_SLOT_5_L
#define EF_DATA_WR_LOCK_KEY_SLOT_5_L_POS  (14U)
#define EF_DATA_WR_LOCK_KEY_SLOT_5_L_LEN  (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_5_L_MSK  (((1U << EF_DATA_WR_LOCK_KEY_SLOT_5_L_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_5_L_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_5_L_UMSK (~(((1U << EF_DATA_WR_LOCK_KEY_SLOT_5_L_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_5_L_POS))
#define EF_DATA_WR_LOCK_BOOT_MODE         EF_DATA_WR_LOCK_BOOT_MODE
#define EF_DATA_WR_LOCK_BOOT_MODE_POS     (15U)
#define EF_DATA_WR_LOCK_BOOT_MODE_LEN     (1U)
#define EF_DATA_WR_LOCK_BOOT_MODE_MSK     (((1U << EF_DATA_WR_LOCK_BOOT_MODE_LEN) - 1) << EF_DATA_WR_LOCK_BOOT_MODE_POS)
#define EF_DATA_WR_LOCK_BOOT_MODE_UMSK    (~(((1U << EF_DATA_WR_LOCK_BOOT_MODE_LEN) - 1) << EF_DATA_WR_LOCK_BOOT_MODE_POS))
#define EF_DATA_WR_LOCK_DBG_PWD           EF_DATA_WR_LOCK_DBG_PWD
#define EF_DATA_WR_LOCK_DBG_PWD_POS       (16U)
#define EF_DATA_WR_LOCK_DBG_PWD_LEN       (1U)
#define EF_DATA_WR_LOCK_DBG_PWD_MSK       (((1U << EF_DATA_WR_LOCK_DBG_PWD_LEN) - 1) << EF_DATA_WR_LOCK_DBG_PWD_POS)
#define EF_DATA_WR_LOCK_DBG_PWD_UMSK      (~(((1U << EF_DATA_WR_LOCK_DBG_PWD_LEN) - 1) << EF_DATA_WR_LOCK_DBG_PWD_POS))
#define EF_DATA_WR_LOCK_SW_USAGE_0        EF_DATA_WR_LOCK_SW_USAGE_0
#define EF_DATA_WR_LOCK_SW_USAGE_0_POS    (17U)
#define EF_DATA_WR_LOCK_SW_USAGE_0_LEN    (1U)
#define EF_DATA_WR_LOCK_SW_USAGE_0_MSK    (((1U << EF_DATA_WR_LOCK_SW_USAGE_0_LEN) - 1) << EF_DATA_WR_LOCK_SW_USAGE_0_POS)
#define EF_DATA_WR_LOCK_SW_USAGE_0_UMSK   (~(((1U << EF_DATA_WR_LOCK_SW_USAGE_0_LEN) - 1) << EF_DATA_WR_LOCK_SW_USAGE_0_POS))
#define EF_DATA_WR_LOCK_WIFI_MAC          EF_DATA_WR_LOCK_WIFI_MAC
#define EF_DATA_WR_LOCK_WIFI_MAC_POS      (18U)
#define EF_DATA_WR_LOCK_WIFI_MAC_LEN      (1U)
#define EF_DATA_WR_LOCK_WIFI_MAC_MSK      (((1U << EF_DATA_WR_LOCK_WIFI_MAC_LEN) - 1) << EF_DATA_WR_LOCK_WIFI_MAC_POS)
#define EF_DATA_WR_LOCK_WIFI_MAC_UMSK     (~(((1U << EF_DATA_WR_LOCK_WIFI_MAC_LEN) - 1) << EF_DATA_WR_LOCK_WIFI_MAC_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_0        EF_DATA_WR_LOCK_KEY_SLOT_0
#define EF_DATA_WR_LOCK_KEY_SLOT_0_POS    (19U)
#define EF_DATA_WR_LOCK_KEY_SLOT_0_LEN    (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_0_MSK    (((1U << EF_DATA_WR_LOCK_KEY_SLOT_0_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_0_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_0_UMSK   (~(((1U << EF_DATA_WR_LOCK_KEY_SLOT_0_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_0_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_1        EF_DATA_WR_LOCK_KEY_SLOT_1
#define EF_DATA_WR_LOCK_KEY_SLOT_1_POS    (20U)
#define EF_DATA_WR_LOCK_KEY_SLOT_1_LEN    (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_1_MSK    (((1U << EF_DATA_WR_LOCK_KEY_SLOT_1_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_1_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_1_UMSK   (~(((1U << EF_DATA_WR_LOCK_KEY_SLOT_1_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_1_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_2        EF_DATA_WR_LOCK_KEY_SLOT_2
#define EF_DATA_WR_LOCK_KEY_SLOT_2_POS    (21U)
#define EF_DATA_WR_LOCK_KEY_SLOT_2_LEN    (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_2_MSK    (((1U << EF_DATA_WR_LOCK_KEY_SLOT_2_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_2_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_2_UMSK   (~(((1U << EF_DATA_WR_LOCK_KEY_SLOT_2_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_2_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_3        EF_DATA_WR_LOCK_KEY_SLOT_3
#define EF_DATA_WR_LOCK_KEY_SLOT_3_POS    (22U)
#define EF_DATA_WR_LOCK_KEY_SLOT_3_LEN    (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_3_MSK    (((1U << EF_DATA_WR_LOCK_KEY_SLOT_3_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_3_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_3_UMSK   (~(((1U << EF_DATA_WR_LOCK_KEY_SLOT_3_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_3_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_4_H      EF_DATA_WR_LOCK_KEY_SLOT_4_H
#define EF_DATA_WR_LOCK_KEY_SLOT_4_H_POS  (23U)
#define EF_DATA_WR_LOCK_KEY_SLOT_4_H_LEN  (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_4_H_MSK  (((1U << EF_DATA_WR_LOCK_KEY_SLOT_4_H_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_4_H_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_4_H_UMSK (~(((1U << EF_DATA_WR_LOCK_KEY_SLOT_4_H_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_4_H_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_5_H      EF_DATA_WR_LOCK_KEY_SLOT_5_H
#define EF_DATA_WR_LOCK_KEY_SLOT_5_H_POS  (24U)
#define EF_DATA_WR_LOCK_KEY_SLOT_5_H_LEN  (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_5_H_MSK  (((1U << EF_DATA_WR_LOCK_KEY_SLOT_5_H_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_5_H_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_5_H_UMSK (~(((1U << EF_DATA_WR_LOCK_KEY_SLOT_5_H_LEN) - 1) << EF_DATA_WR_LOCK_KEY_SLOT_5_H_POS))
#define EF_DATA_RD_LOCK_DBG_PWD           EF_DATA_RD_LOCK_DBG_PWD
#define EF_DATA_RD_LOCK_DBG_PWD_POS       (25U)
#define EF_DATA_RD_LOCK_DBG_PWD_LEN       (1U)
#define EF_DATA_RD_LOCK_DBG_PWD_MSK       (((1U << EF_DATA_RD_LOCK_DBG_PWD_LEN) - 1) << EF_DATA_RD_LOCK_DBG_PWD_POS)
#define EF_DATA_RD_LOCK_DBG_PWD_UMSK      (~(((1U << EF_DATA_RD_LOCK_DBG_PWD_LEN) - 1) << EF_DATA_RD_LOCK_DBG_PWD_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_0        EF_DATA_RD_LOCK_KEY_SLOT_0
#define EF_DATA_RD_LOCK_KEY_SLOT_0_POS    (26U)
#define EF_DATA_RD_LOCK_KEY_SLOT_0_LEN    (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_0_MSK    (((1U << EF_DATA_RD_LOCK_KEY_SLOT_0_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_0_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_0_UMSK   (~(((1U << EF_DATA_RD_LOCK_KEY_SLOT_0_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_0_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_1        EF_DATA_RD_LOCK_KEY_SLOT_1
#define EF_DATA_RD_LOCK_KEY_SLOT_1_POS    (27U)
#define EF_DATA_RD_LOCK_KEY_SLOT_1_LEN    (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_1_MSK    (((1U << EF_DATA_RD_LOCK_KEY_SLOT_1_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_1_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_1_UMSK   (~(((1U << EF_DATA_RD_LOCK_KEY_SLOT_1_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_1_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_2        EF_DATA_RD_LOCK_KEY_SLOT_2
#define EF_DATA_RD_LOCK_KEY_SLOT_2_POS    (28U)
#define EF_DATA_RD_LOCK_KEY_SLOT_2_LEN    (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_2_MSK    (((1U << EF_DATA_RD_LOCK_KEY_SLOT_2_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_2_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_2_UMSK   (~(((1U << EF_DATA_RD_LOCK_KEY_SLOT_2_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_2_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_3        EF_DATA_RD_LOCK_KEY_SLOT_3
#define EF_DATA_RD_LOCK_KEY_SLOT_3_POS    (29U)
#define EF_DATA_RD_LOCK_KEY_SLOT_3_LEN    (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_3_MSK    (((1U << EF_DATA_RD_LOCK_KEY_SLOT_3_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_3_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_3_UMSK   (~(((1U << EF_DATA_RD_LOCK_KEY_SLOT_3_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_3_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_4        EF_DATA_RD_LOCK_KEY_SLOT_4
#define EF_DATA_RD_LOCK_KEY_SLOT_4_POS    (30U)
#define EF_DATA_RD_LOCK_KEY_SLOT_4_LEN    (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_4_MSK    (((1U << EF_DATA_RD_LOCK_KEY_SLOT_4_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_4_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_4_UMSK   (~(((1U << EF_DATA_RD_LOCK_KEY_SLOT_4_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_4_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_5        EF_DATA_RD_LOCK_KEY_SLOT_5
#define EF_DATA_RD_LOCK_KEY_SLOT_5_POS    (31U)
#define EF_DATA_RD_LOCK_KEY_SLOT_5_LEN    (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_5_MSK    (((1U << EF_DATA_RD_LOCK_KEY_SLOT_5_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_5_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_5_UMSK   (~(((1U << EF_DATA_RD_LOCK_KEY_SLOT_5_LEN) - 1) << EF_DATA_RD_LOCK_KEY_SLOT_5_POS))

struct EF_DATA_reg {
    /* 0x0 : ef_cfg_0 */
    union {
        struct
        {
            uint32_t ef_sf_aes_mode     : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t ef_sboot_sign_mode : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t rsvd0              : 2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t rsvd1              : 1; /* [    6],        r/w,        0x0 */
            uint32_t ef_cpu0_enc_en     : 1; /* [    7],        r/w,        0x0 */
            uint32_t ef_boot_sel        : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t ef_sf_key_0_sel    : 2; /* [13:12],        r/w,        0x0 */
            uint32_t rsvd2              : 1; /* [   14],        r/w,        0x0 */
            uint32_t rsvd3              : 1; /* [   15],        r/w,        0x0 */
            uint32_t rsvd4              : 1; /* [   16],        r/w,        0x0 */
            uint32_t ef_0_key_enc_en    : 1; /* [   17],        r/w,        0x0 */
            uint32_t rsvd5              : 1; /* [   18],        r/w,        0x0 */
            uint32_t rsvd6              : 1; /* [   19],        r/w,        0x0 */
            uint32_t rsvd7              : 1; /* [   20],        r/w,        0x0 */
            uint32_t rsvd8              : 1; /* [   21],        r/w,        0x0 */
            uint32_t rsvd9              : 1; /* [   22],        r/w,        0x0 */
            uint32_t rsvd10             : 1; /* [   23],        r/w,        0x0 */
            uint32_t rsvd11             : 2; /* [25:24],        r/w,        0x0 */
            uint32_t ef_dbg_jtag_0_dis  : 2; /* [27:26],        r/w,        0x0 */
            uint32_t ef_dbg_mode        : 4; /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_cfg_0;

